woodsking2/mbed-os/targets/TARGET_Dialog/TARGET_DA1469x/TARGET_SDK_10/sdk_defs.h
/**
 * \addtogroup PLA_BSP_SYSTEM
 * \{
 * \addtogroup BSP_DEFINITIONS SDK Platform Definitions
 *
 * \brief Platform definitions
 *
 * \{
 */

/**
 ****************************************************************************************
 *
 * @file sdk_defs.h
 *
 * @brief Central include header file with platform definitions.
 *
 * Copyright (C) 2015-2019 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */

#ifndef __SDK_DEFS_H__
#define __SDK_DEFS_H__

#include <stddef.h>

#ifdef __cplusplus
 extern "C" {
#endif

#ifdef __GNUC__
#  define GCC_VERSION (__GNUC__ * 10000 \
                               + __GNUC_MINOR__ * 100 \
                               + __GNUC_PATCHLEVEL__)
/* assert gcc version is at least 4.9.3 */
#  if GCC_VERSION < 40903
#    error "Please use gcc version 4.9.3 or newer!"
#  endif
#endif

#if (dg_configUSE_AUTO_CHIP_DETECTION == 1)
   /* use a register description that is generic enough for our needs */
#   include "DA1469xAB.h"
#else
#   include "DA1469xAB.h"
#endif /* dg_configUSE_AUTO_CHIP_DETECTION */

        #include "system_DA1469x.h"                           /* DA1469x System                                                      */

/* --------------------------------- DEBUG GPIO handling macros --------------------------------- */

#define DBG_GET_SET_PAD_LATCH_REG(name)   *(((volatile uint32_t *)(&name##_SET_REG) == (volatile uint32_t *)(&GPIO->P0_SET_DATA_REG)) ? &CRG_TOP->P0_SET_PAD_LATCH_REG : &CRG_TOP->P1_SET_PAD_LATCH_REG)
#define DBG_GET_RESET_PAD_LATCH_REG(name) *(((volatile uint32_t *)(&name##_SET_REG) == (volatile uint32_t *)(&GPIO->P0_SET_DATA_REG)) ? &CRG_TOP->P0_RESET_PAD_LATCH_REG : &CRG_TOP->P1_RESET_PAD_LATCH_REG)
#define DBG_TOGGLE_PIN_PAD_LATCH(name)    DBG_GET_SET_PAD_LATCH_REG(name) = name##_PIN; \
                                          DBG_GET_RESET_PAD_LATCH_REG(name) = name##_PIN
#define DBG_SET_PIN_REG(name)             name##_SET_REG = name##_PIN
#define DBG_RESET_PIN_REG(name)           name##_RESET_REG = name##_PIN

#define DBG_CONFIGURE(flag, name, func)                                          \
{                                                                                \
        if (flag == 1) {                                                         \
                ASSERT_WARNING(REG_GETF(CRG_TOP, SYS_STAT_REG, COM_IS_UP) == 1); \
                name##_MODE_REG = 0x300 + func;                                  \
                DBG_TOGGLE_PIN_PAD_LATCH(name);                                  \
        }                                                                        \
}

#define DBG_CONFIGURE_HIGH(flag, name)                                           \
{                                                                                \
        if (flag == 1) {                                                         \
                ASSERT_WARNING(REG_GETF(CRG_TOP, SYS_STAT_REG, COM_IS_UP) == 1); \
                name##_MODE_REG = 0x300;                                         \
                DBG_SET_PIN_REG(name);                                           \
                DBG_TOGGLE_PIN_PAD_LATCH(name);                                  \
        }                                                                        \
}

#define DBG_CONFIGURE_LOW(flag, name)                                            \
{                                                                                \
        if (flag == 1) {                                                         \
                ASSERT_WARNING(REG_GETF(CRG_TOP, SYS_STAT_REG, COM_IS_UP) == 1); \
                name##_MODE_REG = 0x300;                                         \
                DBG_RESET_PIN_REG(name);                                         \
                DBG_TOGGLE_PIN_PAD_LATCH(name);                                  \
        }                                                                        \
}

#define DBG_SET_HIGH(flag, name)                                                 \
{                                                                                \
        if (flag == 1) {                                                         \
                ASSERT_WARNING(REG_GETF(CRG_TOP, SYS_STAT_REG, COM_IS_UP) == 1); \
                name##_MODE_REG = 0x300;                                         \
                DBG_SET_PIN_REG(name);                                           \
                DBG_TOGGLE_PIN_PAD_LATCH(name);                                  \
        }                                                                        \
}

#define DBG_SET_LOW(flag, name)                                                  \
{                                                                                \
        if (flag == 1) {                                                         \
                ASSERT_WARNING(REG_GETF(CRG_TOP, SYS_STAT_REG, COM_IS_UP) == 1); \
                name##_MODE_REG = 0x300;                                         \
                DBG_RESET_PIN_REG(name);                                         \
                DBG_TOGGLE_PIN_PAD_LATCH(name);                                  \
        }                                                                        \
}


/* ---------------------------------------------------------------------------------------------- */

/************************
 * Memory map
 ************************/

/**
 * \brief Remapped device base address.
 */
#define MEMORY_REMAPPED_BASE    0x00000000UL
 /* The max remapped  region size according to FLASH_REGION_SIZE register field */
#define MEMORY_REMAPPED_END     0x02000000UL

/**
 * \brief Remapped device memory size.
 */
#define MEMORY_REMAPPED_SIZE    (MEMORY_REMAPPED_END - MEMORY_REMAPPED_BASE)

/**
 * \brief ROM base address.
 */
#define MEMORY_ROM_BASE         0x900000UL
#define MEMORY_ROM_END          (MEMORY_ROM_BASE + 0x20000UL)

/**
 * \brief ROM memory size.
 */
#define MEMORY_ROM_SIZE         (MEMORY_ROM_END - MEMORY_ROM_BASE)

/**
 * \brief OTP memory base address.
 */
#define MEMORY_OTP_BASE         0x10080000UL
#define MEMORY_OTP_END          0x10090000UL
 /* Peripheral remap */
#define MEMORY_OTP_BASE_P       0x30080000UL
#define MEMORY_OTP_END_P        0x30090000UL

/**
 * \brief OTP memory size.
 */
#define MEMORY_OTP_SIZE         (MEMORY_OTP_END - MEMORY_OTP_BASE)

/**
 * \brief SYSTEM RAM base address.
 */
#define MEMORY_SYSRAM_BASE      0x20000000UL
#define MEMORY_SYSRAM_END       (MEMORY_SYSRAM_BASE + 0x80000UL)

/**
 * \brief SYSTEM RAM size.
 */
#define MEMORY_SYSRAM_SIZE      (MEMORY_SYSRAM_END - MEMORY_SYSRAM_BASE)

/**
 * \brief CACHE RAM base address.
 */
#define MEMORY_CACHERAM_BASE    0x30060000UL
#define MEMORY_CACHERAM_END     0x30070000UL

/**
 * \brief CACHE RAM size.
 */
#define MEMORY_CACHERAM_SIZE    (MEMORY_CACHERAM_END - MEMORY_CACHERAM_BASE)

/**
 * \brief QSPI Flash base address.
 */
 /*
  * QSPI AHB-C(ode) bus (cached). Accesses through this bus
  * are restricted according to CACHE_FLASH_REG.
  */
#define MEMORY_QSPIF_BASE       (0x16000000UL)
#define MEMORY_QSPIF_END        (MEMORY_QSPIF_BASE + 0x2000000UL)
 /*
  * QSPI AHB-S(ystem) bus (Not cached). Accesses through this bus
  * are not affected by CACHE_FLASH_REG.
  */
#define MEMORY_QSPIF_S_BASE     (0x36000000UL)
#define MEMORY_QSPIF_S_END      (MEMORY_QSPIF_S_BASE + 0x2000000UL)

#define MEMORY_QSPIR_BASE       (0x32000000UL)
#define MEMORY_QSPIR_END        (MEMORY_QSPIR_BASE + 0x2000000UL)

/**
 * \brief QSPI Flash memory size.
 */
#define MEMORY_QSPIF_SIZE       (MEMORY_QSPIF_END - MEMORY_QSPIF_BASE)


/**
 * \brief TRNG FIFO address
 */

#define MEMORY_TRNG_FIFO        0x30050000UL

/**
 * \brief OTP User Data Encryption Keys memory base address
 */
#define MEMORY_OTP_USER_DATA_KEYS_PAYLOAD_START   0x00000A00UL
#define MEMORY_OTP_USER_DATA_KEYS_PAYLOAD_END     0x00000B00UL
#define MEMORY_OTP_USER_DATA_KEYS_INDEX_START     0x000009C0UL
#define MEMORY_OTP_USER_DATA_KEYS_INDEX_END       0x000009E0UL


#define WITHIN_RANGE(_a, _s, _e)        (((uint32_t)(_a) >= (uint32_t)(_s)) && ((uint32_t)(_a) < (uint32_t)(_e)))

/**
 * \brief Address is in the remapped memory region
 */
#define IS_REMAPPED_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_REMAPPED_BASE, MEMORY_REMAPPED_END)

/**
 * \brief Address is in the ROM region
 */
#define IS_ROM_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_ROM_BASE, MEMORY_ROM_END)

/**
 * \brief Address is in the OTP memory region
 */
#define IS_OTP_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_OTP_BASE, MEMORY_OTP_END)

/**
 * \brief Address is in the SYSTEM RAM region
 */
#define IS_SYSRAM_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_SYSRAM_BASE, MEMORY_SYSRAM_END)

/**
 * \brief Address is in the CACHE RAM region
 */
#define IS_CACHERAM_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_CACHERAM_BASE, MEMORY_CACHERAM_END)

/**
 * \brief Address is in the QSPI Flash memory region
 */
#define IS_QSPIF_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIF_BASE, MEMORY_QSPIF_END)

/**
 * \brief Address is in the QSPI AHB-S(ystem) memory region
 */
#define IS_QSPIF_S_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIF_S_BASE, MEMORY_QSPIF_S_END)

#define _BLACK_ORCA_IC_VERSION(revision, stepping) \
        (((revision) << 8) | (stepping))

/**
 * \brief Convenience macro to create the full chip version from revision and stepping.
 *        It takes letters as arguments.
 */
#define BLACK_ORCA_IC_VERSION(revision, stepping) \
        _BLACK_ORCA_IC_VERSION(BLACK_ORCA_IC_REV_##revision, \
                        BLACK_ORCA_IC_STEP_##stepping)

/**
 * \brief The chip version that we compile for.
 */
#define BLACK_ORCA_TARGET_IC \
         _BLACK_ORCA_IC_VERSION(dg_configBLACK_ORCA_IC_REV, dg_configBLACK_ORCA_IC_STEP)


/**
 * \brief Zero-initialized data retained memory attribute
 */
#define __RETAINED                      __attribute__((section("retention_mem_zi")))    // RetRAM0
#define __RETAINED_1                    __attribute__((section("retention_mem_1_zi")))  // RetRAM1

/**
 * \brief Initialized data retained memory attribute
 */
#define __RETAINED_RW                   __attribute__((section("retention_mem_init")))

/**
 * \brief Uninitialized data retained memory attribute. Used for variables that should
 * not be initialized during startup.
 */
#define __RETAINED_UNINIT               __attribute__((section("retention_mem_uninit")))

 /**
  * \brief Constant data retained memory attribute
  */
#define __RETAINED_CONST_INIT           __attribute__((section("retention_mem_const")))

/**
 * \brief Text retained memory attribute
 */
#if ((dg_configCODE_LOCATION == NON_VOLATILE_IS_FLASH) && (dg_configEXEC_MODE == MODE_IS_CACHED))
#define __RETAINED_CODE                 __attribute__((section("text_retained"))) __attribute__((noinline)) __attribute__((optimize ("no-tree-switch-conversion")))
#else
#define __RETAINED_CODE
#endif

/**
 * \brief Attribute to silence warnings about unused parameters/variables/function
 */
#define __UNUSED                __attribute__((unused))

/**
 * \brief Attribute to tell the compiler to consider a symbol as externally visible (for LTO)
 */
#define __LTO_EXT               __attribute__((externally_visible))

extern uint32_t black_orca_chip_version;

#define CHIP_IS_AA                      (black_orca_chip_version == BLACK_ORCA_IC_VERSION(A, A))

/**
 * \brief Get the chip version of the system, at runtime.
 */
__STATIC_INLINE uint32_t black_orca_get_chip_version(void)
{
        uint32_t rev = CHIP_VERSION->CHIP_REVISION_REG - 'A';
        uint32_t step = CHIP_VERSION->CHIP_TEST1_REG;

        return _BLACK_ORCA_IC_VERSION(rev, step);
}

